; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	spectrograph2 - mode
	spectrograph0 - mode
	spectrograph1 - mode
	infrared3 - mode
	Star1 - direction
	Star8 - direction
	Star11 - direction
	GroundStation13 - direction
	GroundStation16 - direction
	Star22 - direction
	GroundStation23 - direction
	GroundStation21 - direction
	Star9 - direction
	GroundStation18 - direction
	GroundStation6 - direction
	Star10 - direction
	GroundStation2 - direction
	GroundStation17 - direction
	GroundStation0 - direction
	GroundStation7 - direction
	Star19 - direction
	GroundStation15 - direction
	GroundStation14 - direction
	Star5 - direction
	Star4 - direction
	Star12 - direction
	GroundStation24 - direction
	GroundStation3 - direction
	GroundStation20 - direction
	Planet25 - direction
	Phenomenon26 - direction
	Planet27 - direction
	Planet28 - direction
	Star29 - direction
	Planet30 - direction
	Planet31 - direction
	Phenomenon32 - direction
	Star33 - direction
	Star34 - direction
	Star35 - direction
	Planet36 - direction
	Planet37 - direction
	Planet38 - direction
	Phenomenon39 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 GroundStation21)
	(supports instrument1 spectrograph2)
	(supports instrument1 infrared3)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation6)
	(calibration_target instrument1 GroundStation24)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 Star10)
	(calibration_target instrument1 GroundStation7)
	(calibration_target instrument1 Star9)
	(calibration_target instrument1 Star19)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument2 spectrograph2)
	(supports instrument2 infrared3)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 GroundStation7)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 GroundStation20)
	(calibration_target instrument2 GroundStation18)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 GroundStation7)
	(calibration_target instrument3 Star19)
	(calibration_target instrument3 GroundStation6)
	(supports instrument4 spectrograph1)
	(supports instrument4 spectrograph2)
	(calibration_target instrument4 GroundStation0)
	(calibration_target instrument4 GroundStation17)
	(calibration_target instrument4 GroundStation24)
	(calibration_target instrument4 GroundStation2)
	(calibration_target instrument4 GroundStation15)
	(calibration_target instrument4 Star10)
	(calibration_target instrument4 Star19)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star29)
	(supports instrument5 spectrograph2)
	(calibration_target instrument5 Star12)
	(calibration_target instrument5 GroundStation15)
	(calibration_target instrument5 Star19)
	(calibration_target instrument5 GroundStation7)
	(supports instrument6 infrared3)
	(calibration_target instrument6 GroundStation20)
	(calibration_target instrument6 GroundStation3)
	(calibration_target instrument6 GroundStation24)
	(calibration_target instrument6 Star12)
	(calibration_target instrument6 Star4)
	(calibration_target instrument6 Star5)
	(calibration_target instrument6 GroundStation14)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star10)
)
(:goal (and
	(pointing satellite2 GroundStation14)
	(have_image Planet25 spectrograph1)
	(have_image Phenomenon26 spectrograph1)
	(have_image Planet27 spectrograph1)
	(have_image Planet28 spectrograph1)
	(have_image Star29 spectrograph2)
	(have_image Planet30 spectrograph0)
	(have_image Planet31 spectrograph0)
	(have_image Phenomenon32 spectrograph1)
	(have_image Star33 spectrograph2)
	(have_image Star34 spectrograph0)
	(have_image Star35 spectrograph0)
	(have_image Planet36 spectrograph0)
	(have_image Planet37 infrared3)
	(have_image Planet38 spectrograph2)
	(have_image Phenomenon39 spectrograph1)
))

)

; plan
1. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 16
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 16
3. (turn_to satellite2 groundstation14 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 groundstation14)
   goals met: 1 of 16
4. (turn_to satellite0 groundstation21 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 groundstation21)
   goals met: 1 of 16
5. (calibrate satellite0 instrument0 groundstation21)
   added: (calibrated instrument0)
   goals met: 1 of 16
6. (turn_to satellite0 phenomenon26 groundstation21)
   deleted: (pointing satellite0 groundstation21)
   added: (pointing satellite0 phenomenon26)
   goals met: 1 of 16
7. (take_image satellite0 phenomenon26 instrument0 spectrograph1)
   added: (have_image phenomenon26 spectrograph1)
   goals met: 2 of 16
8. (turn_to satellite0 phenomenon32 phenomenon26)
   deleted: (pointing satellite0 phenomenon26)
   added: (pointing satellite0 phenomenon32)
   goals met: 2 of 16
9. (take_image satellite0 phenomenon32 instrument0 spectrograph1)
   added: (have_image phenomenon32 spectrograph1)
   goals met: 3 of 16
10. (turn_to satellite0 phenomenon39 phenomenon32)
   deleted: (pointing satellite0 phenomenon32)
   added: (pointing satellite0 phenomenon39)
   goals met: 3 of 16
11. (take_image satellite0 phenomenon39 instrument0 spectrograph1)
   added: (have_image phenomenon39 spectrograph1)
   goals met: 4 of 16
12. (turn_to satellite0 planet25 phenomenon39)
   deleted: (pointing satellite0 phenomenon39)
   added: (pointing satellite0 planet25)
   goals met: 4 of 16
13. (take_image satellite0 planet25 instrument0 spectrograph1)
   added: (have_image planet25 spectrograph1)
   goals met: 5 of 16
14. (turn_to satellite0 planet27 planet25)
   deleted: (pointing satellite0 planet25)
   added: (pointing satellite0 planet27)
   goals met: 5 of 16
15. (take_image satellite0 planet27 instrument0 spectrograph1)
   added: (have_image planet27 spectrograph1)
   goals met: 6 of 16
16. (turn_to satellite0 planet28 planet27)
   deleted: (pointing satellite0 planet27)
   added: (pointing satellite0 planet28)
   goals met: 6 of 16
17. (take_image satellite0 planet28 instrument0 spectrograph1)
   added: (have_image planet28 spectrograph1)
   goals met: 7 of 16
18. (turn_to satellite0 planet30 planet28)
   deleted: (pointing satellite0 planet28)
   added: (pointing satellite0 planet30)
   goals met: 7 of 16
19. (take_image satellite0 planet30 instrument0 spectrograph0)
   added: (have_image planet30 spectrograph0)
   goals met: 8 of 16
20. (turn_to satellite0 planet31 planet30)
   deleted: (pointing satellite0 planet30)
   added: (pointing satellite0 planet31)
   goals met: 8 of 16
21. (take_image satellite0 planet31 instrument0 spectrograph0)
   added: (have_image planet31 spectrograph0)
   goals met: 9 of 16
22. (turn_to satellite0 planet36 planet31)
   deleted: (pointing satellite0 planet31)
   added: (pointing satellite0 planet36)
   goals met: 9 of 16
23. (take_image satellite0 planet36 instrument0 spectrograph0)
   added: (have_image planet36 spectrograph0)
   goals met: 10 of 16
24. (turn_to satellite0 star34 planet36)
   deleted: (pointing satellite0 planet36)
   added: (pointing satellite0 star34)
   goals met: 10 of 16
25. (take_image satellite0 star34 instrument0 spectrograph0)
   added: (have_image star34 spectrograph0)
   goals met: 11 of 16
26. (turn_to satellite0 star35 star34)
   deleted: (pointing satellite0 star34)
   added: (pointing satellite0 star35)
   goals met: 11 of 16
27. (take_image satellite0 star35 instrument0 spectrograph0)
   added: (have_image star35 spectrograph0)
   goals met: 12 of 16
28. (turn_to satellite1 groundstation7 star29)
   deleted: (pointing satellite1 star29)
   added: (pointing satellite1 groundstation7)
   goals met: 12 of 16
29. (calibrate satellite1 instrument2 groundstation7)
   added: (calibrated instrument2)
   goals met: 12 of 16
30. (turn_to satellite1 planet37 groundstation7)
   deleted: (pointing satellite1 groundstation7)
   added: (pointing satellite1 planet37)
   goals met: 12 of 16
31. (take_image satellite1 planet37 instrument2 infrared3)
   added: (have_image planet37 infrared3)
   goals met: 13 of 16
32. (turn_to satellite1 planet38 planet37)
   deleted: (pointing satellite1 planet37)
   added: (pointing satellite1 planet38)
   goals met: 13 of 16
33. (take_image satellite1 planet38 instrument2 spectrograph2)
   added: (have_image planet38 spectrograph2)
   goals met: 14 of 16
34. (turn_to satellite1 star29 planet38)
   deleted: (pointing satellite1 planet38)
   added: (pointing satellite1 star29)
   goals met: 14 of 16
35. (take_image satellite1 star29 instrument2 spectrograph2)
   added: (have_image star29 spectrograph2)
   goals met: 15 of 16
36. (turn_to satellite1 star33 star29)
   deleted: (pointing satellite1 star29)
   added: (pointing satellite1 star33)
   goals met: 15 of 16
37. (take_image satellite1 star33 instrument2 spectrograph2)
   added: (have_image star33 spectrograph2)
   goals met: 16 of 16
